
#ifndef __BUTTON_H__
#define __BUTTON_H__

#ifdef __cplusplus
extern "C" {
#endif

// Includes --------------------------------------------------------------------------//
#include "main.h"

// Exported types -------------------------------------------------------------------//
	//код нажатой кнопки
	typedef enum 
	{
		NO_KEY 						= 	0x00,			//кнопка не нажата	
		KEY_LEFT 					= 	0x01,			//левая кнопка
		KEY_CENTER_SHORT 	= 	0x02,			//короткое нажатие центральной кнопки
		KEY_CENTER_LONG 	= 	0x03,			//длинное нажатие центральной кнопки
		KEY_RIGHT					= 	0x04, 		//правая кнопка
		KEY_ENC_SHORT			= 	0x05,			//короткое нажатие кнопки энкодера
		KEY_ENC_LONG			=		0x06,			//длинное нажатие кнопки энкодера
	} KEY_CODE_t; 					

	//----------------------------------------------------------------------------------//
	typedef enum 
	{
		KEY_STATE_OFF = 0,				//режим - кнопка не нажата
		KEY_STATE_ON,							//режим - кнопка нажата
		KEY_STATE_BOUNCE, 				//режим -  дребезг кнопки
		KEY_STATE_AUTOREPEAT 			//режим - режим ожидания (автоповтора) отжатия кнопки
	} KEY_STATE_t; 							//статус сканирования клавиатуры

	//----------------------------------------------------------------------------------//
	struct KEY_MACHINE_t
	{
		KEY_CODE_t 		key_code;
		KEY_STATE_t 	key_state;
	} ;

//Private defines ------------------------------------------------------------------//

// Prototypes ---------------------------------------------------------------------//
uint16_t scan_keys (void);

#ifdef __cplusplus
}
#endif

#endif /* __BUTTON_H__ */

